fluidized_bed_4/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.01;

vertices
(
    ( 0            0          0  )
    ( 0.0095174    0          0  )
    ( 0.0095174    0.0095174  0  )
    ( 0            0.0095174  0  )
    ( 0            0          0.1  )
    ( 0.0095174    0          0.1  )
    ( 0.0095174    0.0095174  0.1  )
    ( 0            0.0095174  0.1  )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletWalls
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    outletWalls
    {
	type wall;
	faces
	(
	    (4 5 6 7)
	);
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
	    (2 6 7 3)
	    (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
