fluidized_bed_4/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  | =========                 |                                                 |
  | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
  |  \\    /   O peration     | Version:  v3.0+                                 |
  |   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
  |    \\/     M anipulation  |                                                 |
  \*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  inletWalls
  {
	//type	zeroGradient;
    type	fixedValue;
    value	uniform (0 0 0.04);
    //type uniformFixedValue;
    //uniformValue table ((0 (0 0 0)) (0.01 (0 1.5 0)) (0.02 (0 0 0)));
  }

  outletWalls
  {
    type	zeroGradient; 
  }

  fixedWalls
  {
    //type	fixedValue;
    //value	uniform (0 0 0);
	type	slip;
  }
}

// ************************************************************************* //
